skipping upgrade test as the change to the example is a field which forces replacement:
```
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185: -/+ resource "ibm_sm_private_certificate_configuration_root_ca" "private_certificate_root_ca" {
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ common_name                       = "cloud.ibm.com" -> "*.cloud.ibm.com" # forces replacement
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       + config_type                       = (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ country                           = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ created_at                        = "2024-05-30T15:10:44Z" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ created_by                        = "IBMid-666000KAO3" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ crl_expiry                        = "259200s" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ crl_expiry_seconds                = 259200 -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ data                              = (sensitive value)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ expiration_date                   = "2025-05-30T15:10:44Z" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ id                                = "ca-tor/df533632-be44-49c6-9a75-78b7e899f1fe/root-ca" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ key_bits                          = 2048 -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ locality                          = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ max_path_length                   = -1 -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ max_ttl_seconds                   = 31536000 -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:         name                              = "root-ca"
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ organization                      = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ other_sans                        = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ ou                                = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ permitted_dns_domains             = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ postal_code                       = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ province                          = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ secret_type                       = "private_cert" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ serial_number                     = "54:a6:90:05:c4:a9:2f:f6:09:2c:ca:01:79:11:aa:73:a0:fa:0d:1c" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ status                            = "configured" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ street_address                    = [] -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       + ttl                               = (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ ttl_seconds                       = 31536000 -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:       ~ updated_at                        = "2024-05-30T15:10:44Z" -> (known after apply)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:         # (11 unchanged attributes hidden)
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185:     }
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185: 
TestRunUpgradeExample 2024-05-30T15:11:02Z command.go:185: Plan: 1 to add, 0 to change, 1 to destroy.
```